In [1]:
# 175. Combine Two Tables LEETCODE
# SELECT firstName, lastName, city, state
# FROM Person p
# LEFT JOIN Address a ON p.personId = a.personId

In [2]:
# 577. Employee Bonus
# Easy
# Topics
# Companies
# Hint
# SQL Schema
# Pandas Schema
# Table: Employee

# +-------------+---------+
# | Column Name | Type    |
# +-------------+---------+
# | empId       | int     |
# | name        | varchar |
# | supervisor  | int     |
# | salary      | int     |
# +-------------+---------+
# empId is the column with unique values for this table.
# Each row of this table indicates the name and the ID of an employee in addition to their salary and the id of their manager.
 

# Table: Bonus

# +-------------+------+
# | Column Name | Type |
# +-------------+------+
# | empId       | int  |
# | bonus       | int  |
# +-------------+------+
# empId is the column of unique values for this table.
# empId is a foreign key (reference column) to empId from the Employee table.
# Each row of this table contains the id of an employee and their respective bonus.
 

# Write a solution to report the name and bonus amount of each employee with a bonus less than 1000.

# Return the result table in any order.

# The result format is in the following example.

In [3]:
# SELECT e.name, b.bonus
# FROM Employee e
# LEFT JOIN Bonus b ON e.empId = b.empId
# WHERE b.bonus < 1000 OR b.bonus IS NULL;

In [ ]:
# 181. Employees Earning More Than Their Managers
# Easy
# Topics
# Companies
# SQL Schema
# Pandas Schema
# Table: Employee

# +-------------+---------+
# | Column Name | Type    |
# +-------------+---------+
# | id          | int     |
# | name        | varchar |
# | salary      | int     |
# | managerId   | int     |
# +-------------+---------+
# id is the primary key (column with unique values) for this table.
# Each row of this table indicates the ID of an employee, their name, salary, and the ID of their manager.
 

# Write a solution to find the employees who earn more than their managers.

# Return the result table in any order.

# The result format is in the following example.

 

# Example 1:

# Input: 
# Employee table:
# +----+-------+--------+-----------+
# | id | name  | salary | managerId |
# +----+-------+--------+-----------+
# | 1  | Joe   | 70000  | 3         |
# | 2  | Henry | 80000  | 4         |
# | 3  | Sam   | 60000  | Null      |
# | 4  | Max   | 90000  | Null      |
# +----+-------+--------+-----------+
# Output: 
# +----------+
# | Employee |
# +----------+
# | Joe      |
# +----------+
# Explanation: Joe is the only employee who earns more than his manager.

In [ ]:
# SELECT e.name AS Employee
# FROM Employee e
# JOIN Employee m ON e.managerId = m.id
# WHERE e.salary > m.salary

In [ ]:
# 182. Duplicate Emails
# Easy
# Topics
# Companies
# SQL Schema
# Pandas Schema
# Table: Person

# +-------------+---------+
# | Column Name | Type    |
# +-------------+---------+
# | id          | int     |
# | email       | varchar |
# +-------------+---------+
# id is the primary key (column with unique values) for this table.
# Each row of this table contains an email. The emails will not contain uppercase letters.
 

# Write a solution to report all the duplicate emails. Note that it's guaranteed that the email field is not NULL.

# Return the result table in any order.

# The result format is in the following example.

 

# Example 1:

# Input: 
# Person table:
# +----+---------+
# | id | email   |
# +----+---------+
# | 1  | a@b.com |
# | 2  | c@d.com |
# | 3  | a@b.com |
# +----+---------+
# Output: 
# +---------+
# | Email   |
# +---------+
# | a@b.com |
# +---------+
# Explanation: a@b.com is repeated two times.

In [6]:
# SELECT email AS Email
# FROM Person
# GROUP BY email
# HAVING COUNT(*) > 1

In [5]:
# 183. Customers Who Never Order
# Easy
# Topics
# Companies
# SQL Schema
# Pandas Schema
# Table: Customers

# +-------------+---------+
# | Column Name | Type    |
# +-------------+---------+
# | id          | int     |
# | name        | varchar |
# +-------------+---------+
# id is the primary key (column with unique values) for this table.
# Each row of this table indicates the ID and name of a customer.
 

# Table: Orders

# +-------------+------+
# | Column Name | Type |
# +-------------+------+
# | id          | int  |
# | customerId  | int  |
# +-------------+------+
# id is the primary key (column with unique values) for this table.
# customerId is a foreign key (reference columns) of the ID from the Customers table.
# Each row of this table indicates the ID of an order and the ID of the customer who ordered it.
 

# Write a solution to find all customers who never order anything.

# Return the result table in any order.

# The result format is in the following example.

 

# Example 1:

# Input: 
# Customers table:
# +----+-------+
# | id | name  |
# +----+-------+
# | 1  | Joe   |
# | 2  | Henry |
# | 3  | Sam   |
# | 4  | Max   |
# +----+-------+
# Orders table:
# +----+------------+
# | id | customerId |
# +----+------------+
# | 1  | 3          |
# | 2  | 1          |
# +----+------------+
# Output: 
# +-----------+
# | Customers |
# +-----------+
# | Henry     |
# | Max       |
# +-----------+

In [4]:
# SELECT name AS Customers
# FROM Customers c
# LEFT JOIN Orders o
# ON c.id = o.customerId
# WHERE o.id IS NULL;

# LEFT JOIN REQUIRED BECAUSE WE NEED TO RETURN ALL FIRT THE  FILETER WITH WHERE CLAUSE

In [7]:
# 196. Delete Duplicate Emails
# Solved
# Easy
# Topics
# Companies
# SQL Schema
# Pandas Schema
# Table: Person

# +-------------+---------+
# | Column Name | Type    |
# +-------------+---------+
# | id          | int     |
# | email       | varchar |
# +-------------+---------+
# id is the primary key (column with unique values) for this table.
# Each row of this table contains an email. The emails will not contain uppercase letters.
 

# Write a solution to delete all duplicate emails, keeping only one unique email with the smallest id.

# For SQL users, please note that you are supposed to write a DELETE statement and not a SELECT one.

# For Pandas users, please note that you are supposed to modify Person in place.

# After running your script, the answer shown is the Person table. The driver will first compile and run your piece of code and then show the Person table. The final order of the Person table does not matter.

# The result format is in the following example.

 

# Example 1:

# Input: 
# Person table:
# +----+------------------+
# | id | email            |
# +----+------------------+
# | 1  | john@example.com |
# | 2  | bob@example.com  |
# | 3  | john@example.com |
# +----+------------------+
# Output: 
# +----+------------------+
# | id | email            |
# +----+------------------+
# | 1  | john@example.com |
# | 2  | bob@example.com  |
# +----+------------------+
# Explanation: john@example.com is repeated two times. We keep the row with the smallest Id = 1.

In [8]:
# DELETE p1
# FROM Person p1
# JOIN  Person p2
# ON p1.email = p2.email AND p1.id > p2.id

In [ ]:
# 197. Rising Temperature
# Solved
# Easy
# Topics
# Companies
# SQL Schema
# Pandas Schema
# Table: Weather

# +---------------+---------+
# | Column Name   | Type    |
# +---------------+---------+
# | id            | int     |
# | recordDate    | date    |
# | temperature   | int     |
# +---------------+---------+
# id is the column with unique values for this table.
# There are no different rows with the same recordDate.
# This table contains information about the temperature on a certain day.
 

# Write a solution to find all dates' id with higher temperatures compared to its previous dates (yesterday).

# Return the result table in any order.

# The result format is in the following example.

 

# Example 1:

# Input: 
# Weather table:
# +----+------------+-------------+
# | id | recordDate | temperature |
# +----+------------+-------------+
# | 1  | 2015-01-01 | 10          |
# | 2  | 2015-01-02 | 25          |
# | 3  | 2015-01-03 | 20          |
# | 4  | 2015-01-04 | 30          |
# +----+------------+-------------+
# Output: 
# +----+
# | id |
# +----+
# | 2  |
# | 4  |
# +----+
# Explanation: 
# In 2015-01-02, the temperature was higher than the previous day (10 -> 25).
# In 2015-01-04, the temperature was higher than the previous day (20 -> 30).

In [ ]:
# import pandas as pd

# def rising_temperature(weather: pd.DataFrame) -> pd.DataFrame:
#     weather = weather.sort_values('recordDate').reset_index()
#     mask = weather["temperature"] > weather["temperature"].shift(1)
#     mask2 = (weather["recordDate"] - weather["recordDate"].shift(1)).dt.days == 1
#     result = weather[mask & mask2]
#     return result[['id']]

In [1]:
# 511. Game Play Analysis I
# Table: Activity

# +--------------+---------+
# | Column Name  | Type    |
# +--------------+---------+
# | player_id    | int     |
# | device_id    | int     |
# | event_date   | date    |
# | games_played | int     |
# +--------------+---------+
# (player_id, event_date) is the primary key (combination of columns with unique values) of this table.
# This table shows the activity of players of some games.
# Each row is a record of a player who logged in and played a number of games (possibly 0) before logging out on someday using some device.
 

# Write a solution to find the first login date for each player.

# Return the result table in any order.

# The result format is in the following example.

 

# Example 1:

# Input: 
# Activity table:
# +-----------+-----------+------------+--------------+
# | player_id | device_id | event_date | games_played |
# +-----------+-----------+------------+--------------+
# | 1         | 2         | 2016-03-01 | 5            |
# | 1         | 2         | 2016-05-02 | 6            |
# | 2         | 3         | 2017-06-25 | 1            |
# | 3         | 1         | 2016-03-02 | 0            |
# | 3         | 4         | 2018-07-03 | 5            |
# +-----------+-----------+------------+--------------+
# Output: 
# +-----------+-------------+
# | player_id | first_login |
# +-----------+-------------+
# | 1         | 2016-03-01  |
# | 2         | 2017-06-25  |
# | 3         | 2016-03-02  |
# +-----------+-------------+

In [2]:
# import pandas as pd

# def game_analysis(activity: pd.DataFrame) -> pd.DataFrame:
#     idx = activity.groupby("player_id")["event_date"].idxmin()
#     activity = activity.loc[idx]
#     activity.drop(["device_id", "games_played"], axis=1, inplace=True)
#     activity.rename(columns={"event_date": "first_login"}, inplace=True)
#     return activity

In [3]:
# 584. Find Customer Referee
# Easy
# Topics
# Companies
# Hint
# SQL Schema
# Pandas Schema
# Table: Customer

# +-------------+---------+
# | Column Name | Type    |
# +-------------+---------+
# | id          | int     |
# | name        | varchar |
# | referee_id  | int     |
# +-------------+---------+
# In SQL, id is the primary key column for this table.
# Each row of this table indicates the id of a customer, their name, and the id of the customer who referred them.
 

# Find the names of the customer that are not referred by the customer with id = 2.

# Return the result table in any order.

# The result format is in the following example.

 

# Example 1:

# Input: 
# Customer table:
# +----+------+------------+
# | id | name | referee_id |
# +----+------+------------+
# | 1  | Will | null       |
# | 2  | Jane | null       |
# | 3  | Alex | 2          |
# | 4  | Bill | null       |
# | 5  | Zack | 1          |
# | 6  | Mark | 2          |
# +----+------+------------+
# Output: 
# +------+
# | name |
# +------+
# | Will |
# | Jane |
# | Bill |
# | Zack |
# +------+

In [4]:
# SELECT name
# FROM Customer
# WHERE referee_id != 2 OR referee_id IS NULL;

In [5]:
# 586. Customer Placing the Largest Number of Orders

# Table: Orders

# +-----------------+----------+
# | Column Name     | Type     |
# +-----------------+----------+
# | order_number    | int      |
# | customer_number | int      |
# +-----------------+----------+
# order_number is the primary key (column with unique values) for this table.
# This table contains information about the order ID and the customer ID.
 

# Write a solution to find the customer_number for the customer who has placed the largest number of orders.

# The test cases are generated so that exactly one customer will have placed more orders than any other customer.

# The result format is in the following example.

 

# Example 1:

# Input: 
# Orders table:
# +--------------+-----------------+
# | order_number | customer_number |
# +--------------+-----------------+
# | 1            | 1               |
# | 2            | 2               |
# | 3            | 3               |
# | 4            | 3               |
# +--------------+-----------------+
# Output: 
# +-----------------+
# | customer_number |
# +-----------------+
# | 3               |
# +-----------------+
# Explanation: 
# The customer with number 3 has two orders, which is greater than either customer 1 or 2 because each of them only has one order. 
# So the result is customer_number 3.

In [6]:
# POSTGRES SOLUTION========================
# SELECT customer_number
# FROM Orders
# GROUP BY customer_number
# ORDER BY COUNT(*) DESC
# LIMIT 1

# PANDAS SOLUTION===========================

import pandas as pd

def largest_orders(orders: pd.DataFrame) -> pd.DataFrame:
    s = []
    if not orders.empty:
        s.append(orders["customer_number"].value_counts().idxmax())
    return pd.DataFrame(s, columns=["customer_number"])

In [7]:
# 595. Big Countries

# Table: World

# +-------------+---------+
# | Column Name | Type    |
# +-------------+---------+
# | name        | varchar |
# | continent   | varchar |
# | area        | int     |
# | population  | int     |
# | gdp         | bigint  |
# +-------------+---------+
# name is the primary key (column with unique values) for this table.
# Each row of this table gives information about the name of a country, the continent to which it belongs, its area, the population, and its GDP value.
 

# A country is big if:

# it has an area of at least three million (i.e., 3000000 km2), or
# it has a population of at least twenty-five million (i.e., 25000000).
# Write a solution to find the name, population, and area of the big countries.

# Return the result table in any order.

# The result format is in the following example.

 

# Example 1:

# Input: 
# World table:
# +-------------+-----------+---------+------------+--------------+
# | name        | continent | area    | population | gdp          |
# +-------------+-----------+---------+------------+--------------+
# | Afghanistan | Asia      | 652230  | 25500100   | 20343000000  |
# | Albania     | Europe    | 28748   | 2831741    | 12960000000  |
# | Algeria     | Africa    | 2381741 | 37100000   | 188681000000 |
# | Andorra     | Europe    | 468     | 78115      | 3712000000   |
# | Angola      | Africa    | 1246700 | 20609294   | 100990000000 |
# +-------------+-----------+---------+------------+--------------+
# Output: 
# +-------------+------------+---------+
# | name        | population | area    |
# +-------------+------------+---------+
# | Afghanistan | 25500100   | 652230  |
# | Algeria     | 37100000   | 2381741 |
# +-------------+------------+---------+

In [9]:
# Pandas solution===============
import pandas as pd

def big_countries(world: pd.DataFrame) -> pd.DataFrame:
    world.drop(columns=["continent", "gdp"], inplace=True)
    mask_1 = world["area"] >= 3000000
    mask_2 = world["population"] >= 25000000
    world = world[mask_1 | mask_2]
    return world

In [10]:
# 596. Classes More Than 5 Students
# Table: Courses

# +-------------+---------+
# | Column Name | Type    |
# +-------------+---------+
# | student     | varchar |
# | class       | varchar |
# +-------------+---------+
# (student, class) is the primary key (combination of columns with unique values) for this table.
# Each row of this table indicates the name of a student and the class in which they are enrolled.
 

# Write a solution to find all the classes that have at least five students.

# Return the result table in any order.

# The result format is in the following example.

 

# Example 1:

# Input: 
# Courses table:
# +---------+----------+
# | student | class    |
# +---------+----------+
# | A       | Math     |
# | B       | English  |
# | C       | Math     |
# | D       | Biology  |
# | E       | Math     |
# | F       | Computer |
# | G       | Math     |
# | H       | Math     |
# | I       | Math     |
# +---------+----------+
# Output: 
# +---------+
# | class   |
# +---------+
# | Math    |
# +---------+
# Explanation: 
# - Math has 6 students, so we include it.
# - English has 1 student, so we do not include it.
# - Biology has 1 student, so we do not include it.
# - Computer has 1 student, so we do not include it.

In [ ]:
import pandas as pd

def find_classes(courses: pd.DataFrame) -> pd.DataFrame:
    if courses.empty:
        return pd.DataFrame(columns=["class"])
    
    grouped = courses.groupby("class")
    max_class_name = []
    
    for k, v in grouped.groups.items():
        if len(v) >= 5:
            max_class_name.append(k)

    return pd.DataFrame(max_class_name, columns=["class"])